In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

# replacing custom missing value with numpy NaN value

In [5]:
df.replace('NA', np.nan, inplace=True)  
df.replace('Missing', np.nan, inplace=True)

In [6]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

# dropna() method
#  ==> by default yedi NaN value vetyo vani index or row drop garcha
#  ==> dropna() method accepts argument inplace=True for overwriting changes

In [7]:
# df.dropna()     

# df.dropna(axis='index', how='any')

In [8]:
# df.dropna(axis='columns')  # yedi NaN value or None vetyo vani column wise drop garcha
# df.dropna(axis='columns', how='all')

# subset property of driopna() method

In [9]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [10]:
#df.dropna(axis='index', how='all', subset=['last', 'email'], inplace=True)

In [11]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

#  isna() method for checking NaN value

In [12]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

# fillna()
#  ==> it is used to fill NaN values with another fillable values

In [13]:
df.fillna(0)

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      0        0                        0   0

In [14]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [15]:
# df['age'].mean()

#  checking data type of NaN values of the dataframe

In [16]:
type(np.nan)

float

# Converting data type of column to another data type

In [17]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [18]:
df['age'] = df['age'].astype(float)            


# df['age'] = df['age'].astype(int)

In [19]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [20]:


# 1st you need to fill all NaN values with 0                         
df.fillna(0, inplace=True)             

# 2nd : now u can change age column type to int type
df['age'] = df['age'].astype(int)

In [21]:
df

   first     last                    email  age
0  Corey  Schafer  CoreyMSchafer@gmail.com   33
1   Jane      Doe        JaneDoe@email.com   55
2   John      Doe        JohnDoe@email.com   63
3  Chris  Schafer                        0   36
4      0        0                        0    0
5      0        0      Anonymous@email.com    0
6      0        0                        0    0

In [22]:
df['age'].mean()
# df['age'].median()

26.714285714285715